import sys

# pycache を生成しない
sys.dont_write_bytecode = True

# srcフォルダの絶対パス
SRC_PATH = "C:/keiba_ai/keiba_ai_ver2.0/src/"
# dataフォルダの絶対パス
DATA_PATH = "C:/keiba_ai/keiba_ai_ver2.0/data/"
# libフォルダの絶対パス
LIB_PATH = "C:/keiba_ai/keiba_ai_ver2.0/libs/"
# textフォルダの絶対パス
TEXT_PATH = "C:/keiba_ai/keiba_ai_ver2.0/texts/"

# 予想印のリスト
SYMBOL_LIST = ["◎", "○", "▲", "△", "☆"]

# 開催場のidリスト
PLACE_LIST = ["01_sapporo","02_hakodate","03_fukushima","04_nigata","05_tokyo","06_nakayama","07_chukyo","08_kyoto","09_hanshin","10_kokura"]

# 開催場の名前リスト
NAME_LIST = ["札幌", "函館", "福島", "新潟", "東京", "中山", "中京", "京都", "阪神", "小倉"]

# クラスのリスト
CLASS_LIST = ["未勝利", "新馬", "1勝クラス", "2勝クラス", "3勝クラス", "オープン"]

# 馬場状態のリスト
GROUND_STATE_LIST = ["良", "稍重", "重", "不良"]

# 識別のリスト
BETTING_TYPE_LIST = ["単勝", "複勝", "枠連", "馬連", "ワイド", "馬単", "三連複", "三連単"]

# 競馬場ごとのコース情報のリスト
COURSE_LISTS =[ [["芝","1000"],["芝","1200"],["芝","1500"],["芝","1800"],["芝","2000"],["芝","2600"],
                 ["ダート","1000"],["ダート","1700"],["ダート","2400"]],                                                      # 01_sapporo
                [["芝","1000"],["芝","1200"],["芝","1800"],["芝","2000"],["芝","2600"],
                 ["ダート","1000"],["ダート","1700"],["ダート","2400"]],                                                      # 02_hakodate
                [["芝","1200"],["芝","1800"],["芝","2000"],["芝","2600"],
                 ["ダート","1150"],["ダート","1700"],["ダート","2400"]],                                                      # 03_fukushima
                [["芝","1000"],["芝","1200"],["芝","1400"],["芝","1600"],["芝","1800"],["芝","2000"],["芝","2200"],["芝","2400"],
                 ["ダート","1200"],["ダート","1800"],["ダート","2500"]],                                                      # 04_nigata
                [["芝","1400"],["芝","1600"],["芝","1800"],["芝","2000"],["芝","2300"],["芝","2400"],["芝","2500"],["芝","3400"],
                 ["ダート","1300"],["ダート","1400"],["ダート","1600"],["ダート","2100"],["ダート","2400"]],                   # 05_tokyo
                [["芝","1200"],["芝","1600"],["芝","1800"],["芝","2000"],["芝","2200"],["芝","2500"],["芝","3600"],
                 ["ダート","1200"],["ダート","1800"],["ダート","2400"],["ダート","2500"]],                                     # 06_nakayama
                [["芝","1200"],["芝","1400"],["芝","1600"],["芝","2000"],["芝","2200"],
                 ["ダート","1200"],["ダート","1400"],["ダート","1800"],["ダート","1900"]],                                     # 07_chukyo
                [["芝","1200"],["芝","1400"],["芝","1600"],["芝","1800"],["芝","2000"],["芝","2200"],["芝","2400"],["芝","3000"],["芝","3200"],
                 ["ダート","1200"],["ダート","1400"],["ダート","1800"],["ダート","1900"]],                                     # 08_kyoto
                [["芝","1200"],["芝","1400"],["芝","1600"],["芝","1800"],["芝","2000"],["芝","2200"],["芝","2400"],["芝","2600"],["芝","3000"],
                 ["ダート","1200"],["ダート","1400"],["ダート","1800"],["ダート","2000"]],                                     # 09_hanshin
                [["芝","1200"],["芝","1700"],["芝","1800"],["芝","2000"],["芝","2600"],
                 ["ダート","1000"],["ダート","1700"],["ダート","2400"]],                                                       # 10_kokura          
              ]

# postするレースのリスト
POST_RACE_LIST=[
    [9,10,11,12], #sapporo
    [9,10,11,12], #hakodate
    [9,10,11,12], #fukushima
    [6,7,8,9], #nigata
    [9,10,11,12], #tokyo
    [9,10,11,12], #nakayama
    [6,7,8,9], #chukyo
    [9,10,11,12], #kyoto
    [9,10,11,12], #hanshin
    [9,10,11,12], #kokura
]